const data = [
    {
        Місце: 1,
        Команда: "Технологія-Агросвіт (Суми)",
        М: 3,
        В: 1,
        Н: 1,
        П: 1,
        Заб: 7,
        Про: 7,
        Різн: 0,
        О: 4,
    },

    {
        Місце: 1,
        Команда: "Athletic Futsal (Дніпро)",
        М: 4,
        В: 3,
        Н: 0,
        П: 1,
        Заб: 11,
        Про: 4,
        Різн: 7,
        О: 9,
    },

    {
        Місце: 1,
        Команда: "ZPgroup (Запоріжжя)",
        М: 3,
        В: 2,
        Н: 1,
        П: 0,
        Заб: 9,
        Про: 5,
        Різн: 4,
        О: 7,
    },

    {
        Місце: 1,
        Команда: "Суха Балка (Жовті Води)",
        М: 4,
        В: 1,
        Н: 0,
        П: 3,
        Заб: 9,
        Про: 14,
        Різн: -5,
        О: 3,
},



{
    Місце: 1,
    Команда: "МСК Харків-2 (Харків)",
    М: 3,
    В: 0,
    Н: 2,
    П: 1,
    Заб: 3,
    Про: 6,
    Різн: -1,
    О: 2,
},

{
    Місце: 1,
    Команда: "AM Estate (Дніпро)",
    М: 3,
    В: 0,
    Н: 2,
    П: 1,
    Заб: 3,
    Про: 8,
    Різн: -5,
    О: 2,
},


  // ...
];


// Сортировка данных по количеству набранных очков (О) и забитым мячам (Заб)
data.sort((a, b) => {
if (b.О === a.О) {
    return b.Заб - a.Заб;
}
    return b.О - a.О;
});


// Отображение данных в таблице
const tableBody = document.getElementById("table-body");
data.forEach((row, index) => {
    const newRow = document.createElement("tr");
    if (row.Команда === 'Технологія-Агросвіт (Суми)') {
        newRow.classList.add('highlighted');
    }
    newRow.innerHTML = `
        <td>${index + 1}</td>
        <td class="team-name">${row.Команда}</td>
        <td>${row.М}</td>
        <td>${row.В}</td>
        <td>${row.Н}</td>
        <td>${row.П}</td>
        <td>${row.Заб}</td>
        <td>${row.Про}</td>
        <td>${row.Різн}</td>
        <td>${row.О}</td>
    `;
    tableBody.appendChild(newRow);
});

const data1 = [
    {
        Місце: 2,
        Команда: "Фурнітура_Експрес24 (Коломия)",
        М: 4,
        В: 3,
        Н: 1,
        П: 0,
        Заб: 14,
        Про: 9,
        Різн: 5,
        О: 10,
    },

    {
        Місце: 2,
        Команда: "Кардинал-2-Авангард-ДЮСШ №4 (Рівне)",
        М: 4,
        В: 2,
        Н: 1,
        П: 1,
        Заб: 14,
        Про: 9,
        Різн: 5,
        О: 7,
    },

    {
        Місце: 2,
        Команда: "Комфорт-Сервіс (Рівне)",
        М: 4,
        В: 0,
        Н: 1,
        П: 3,
        Заб: 8,
        Про: 18,
        Різн: -10,
        О: 1,
    },

    {
        Місце: 2,
        Команда: "Черкасиобленерго (Черкаси)",
        М: 4,
        В: 2,
        Н: 1,
        П: 1,
        Заб: 12,
        Про: 9,
        Різн: 3,
        О: 7,
},



{
    Місце: 2,
    Команда: "Любарт (Луцьк)",
    М: 4,
    В: 2,
    Н: 0,
    П: 2,
    Заб: 14,
    Про: 19,
    Різн: 5,
    О: 6,
},

{
    Місце: 2,
    Команда: "Elixus-Хімік-Танчик (Рівне)",
    М: 4,
    В: 0,
    Н: 2,
    П: 2,
    Заб: 11,
    Про: 19,
    Різн: -8,
    О: 2,
},


  // ...
];


// Сортировка данных по количеству набранных очков (О) и забитым мячам (Заб)
data1.sort((a, b) => {
if (b.О === a.О) {
    return b.Заб - a.Заб;
}
    return b.О - a.О;
});


// Отображение данных в таблице
const tableBodya = document.getElementById("table-bodya");
data1.forEach((row, index) => {
    const newRow = document.createElement("tr");
    // if (row.Команда === 'Технологія-Агросвіт') {
    //     newRow.classList.add('highlighted');
    // }
    newRow.innerHTML = `
        <td>${index + 1}</td>
        <td class="team-name">${row.Команда}</td>
        <td>${row.М}</td>
        <td>${row.В}</td>
        <td>${row.Н}</td>
        <td>${row.П}</td>
        <td>${row.Заб}</td>
        <td>${row.Про}</td>
        <td>${row.Різн}</td>
        <td>${row.О}</td>
    `;
    tableBodya.appendChild(newRow);
});


const data2 = [
    {
        Місце: 2,
        Команда: "Україна (Токарі)",
        М: 3,
        В: 2,
        Н: 1,
        П: 0,
        Заб: 12,
        Про: 2,
        Різн: 10,
        О: 7,
    },

    {
        Місце: 2,
        Команда: "СКІФ-СДПУ",
        М: 3,
        В: 2,
        Н: 1,
        П: 0,
        Заб: 11,
        Про: 5,
        Різн: 3,
        О: 7,
    },

    {
        Місце: 2,
        Команда: "Газмережі СФ",
        М: 3,
        В: 2,
        Н: 1,
        П: 0,
        Заб: 6,
        Про: 4,
        Різн: 2,
        О: 7,
    },

    {
        Місце: 2,
        Команда: "Технологія-Агросвіт",
        М: 3,
        В: 2,
        Н: 0,
        П: 1,
        Заб: 13,
        Про: 4,
        Різн: 9,
        О: 6,
},



{
    Місце: 2,
    Команда: "O’GRADY’S Team",
    М: 3,
    В: 1,
    Н: 1,
    П: 1,
    Заб: 7,
    Про: 7,
    Різн: 0,
    О: 4,
},

{
    Місце: 2,
    Команда: "CompService",
    М: 3,
    В: 1,
    Н: 1,
    П: 1,
    Заб: 3,
    Про: 11,
    Різн: -8,
    О: 4,
},

{
    Місце: 2,
    Команда: "Сумиобленерго",
    М: 3,
    В: 1,
    Н: 0,
    П: 2,
    Заб: 7,
    Про: 7,
    Різн: 0,
    О: 3,
},

{
    Місце: 2,
    Команда: "Спортивний клуб поліцейських Сумщини",
    М: 3,
    В: 1,
    Н: 0,
    П: 2,
    Заб: 8,
    Про: 10,
    Різн: -2,
    О: 3,
},

{
    Місце: 2,
    Команда: "Явір Краснопілля",
    М: 3,
    В: 0,
    Н: 1,
    П: 2,
    Заб: 4,
    Про: 11,
    Різн: -7,
    О: 1,
},

{
    Місце: 2,
    Команда: "СумДУ",
    М: 3,
    В: 0,
    Н: 0,
    П: 3,
    Заб: 5,
    Про: 15,
    Різн: -10,
    О: 0,
},


  // ...
];


// Сортировка данных по количеству набранных очков (О) и забитым мячам (Заб)
data2.sort((a, b) => {
if (b.О === a.О) {
    return b.Заб - a.Заб;
}
    return b.О - a.О;
});


// Отображение данных в таблице
const tableBodyb = document.getElementById("table-bodyb");
data2.forEach((row, index) => {
    const newRow = document.createElement("tr");
    if (row.Команда === 'Технологія-Агросвіт') {
        newRow.classList.add('highlighted');
    }
    newRow.innerHTML = `
        <td>${index + 1}</td>
        <td class="team-name">${row.Команда}</td>
        <td>${row.М}</td>
        <td>${row.В}</td>
        <td>${row.Н}</td>
        <td>${row.П}</td>
        <td>${row.Заб}</td>
        <td>${row.Про}</td>
        <td>${row.Різн}</td>
        <td>${row.О}</td>
    `;
    tableBodyb.appendChild(newRow);
});




